In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(829, datetime.time(8, 49, 56), 91, 'free', None, None, 829, 'Dallas-Fort Worth-Arlington, TX', 'Mozilla/5.0 (compatible; MSIE 10.0; Windows NT 6.2; WOW64; Trident/6.0)'),
 (1049, datetime.time(16, 56, 36), 73, 'paid', None, None, 1049, 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (986, datetime.time(12, 33, 16), 86, 'free', None, None, 986, 'La Crosse-Onalaska, WI-MN', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/37.0.2062.94 Safari/537.36"'),
 (1051, datetime.time(9, 56, 36), 24, 'paid', None, None, 1051, 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (1068, datetime.time(12, 43, 16), 26, 'free', None, None, 1068, 'San Jose-Sunnyvale-Santa Clara, CA', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"')]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(91, 'Jayden', 'Bell', 'M', 'free'),
 (73, 'Jacob', 'Klein', 'M', 'paid'),
 (86, 'Aiden', 'Hess', 'M', 'free'),
 (24, 'Layla', 'Griffin', 'F', 'paid'),
 (26, 'Ryan', 'Smith', 'M', 'free')]

In [5]:
%sql SELECT * FROM songs LIMIT 2;

 * postgresql://student:***@127.0.0.1/sparkifydb
2 rows affected.

[('SOMZWCG12A8C13C480', "I Didn't Mean To", 'ARD7TVE1187B99BFB1', 0, Decimal('218.93179')),
 ('SOUDSGM12AC9618304', 'Insatiable (Instrumental Version)', 'ARNTLGG11E2835DDB9', 0, Decimal('266.39628'))]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARD7TVE1187B99BFB1', 'Casual', 'California - LA', Decimal('NaN'), Decimal('NaN')),
 ('ARNTLGG11E2835DDB9', 'Clp', '', Decimal('NaN'), Decimal('NaN')),
 ('AR8ZCNI1187B9A069B', 'Planet P Project', '', Decimal('NaN'), Decimal('NaN')),
 ('AR10USD1187B99F3F1', 'Tweeterfriendly Music', 'Burlington, Ontario, Canada', Decimal('NaN'), Decimal('NaN')),
 ('ARMJAGH1187FB546F3', 'The Box Tops', 'Memphis, TN', Decimal('35.14968'), Decimal('-90.04892'))]

In [7]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.time(0, 22, 7, 796000), 0, 30, 48, 11, 2018, 4),
 (datetime.time(1, 8, 41, 796000), 1, 30, 48, 11, 2018, 4),
 (datetime.time(1, 12, 48, 796000), 1, 30, 48, 11, 2018, 4),
 (datetime.time(1, 17, 5, 796000), 1, 30, 48, 11, 2018, 4),
 (datetime.time(1, 20, 56, 796000), 1, 30, 48, 11, 2018, 4)]

In [22]:
%sql SELECT location, COUNT(*)  AS num_songs, round((COUNT(*)/SUM(COUNT(*)) OVER()) * 100, 1) AS prcnt_total FROM songplays GROUP BY location ORDER BY 2 DESC LIMIT 10

 * postgresql://student:***@127.0.0.1/sparkifydb
10 rows affected.

[('San Jose-Sunnyvale-Santa Clara, CA', 60, Decimal('7.7')),
 ('New York-Newark-Jersey City, NY-NJ-PA', 59, Decimal('7.6')),
 ('San Francisco-Oakland-Hayward, CA', 44, Decimal('5.7')),
 ('Houston-The Woodlands-Sugar Land, TX', 34, Decimal('4.4')),
 ('Portland-South Portland, ME', 33, Decimal('4.3')),
 ('Atlanta-Sandy Springs-Roswell, GA', 29, Decimal('3.7')),
 ('Sacramento--Roseville--Arden-Arcade, CA', 24, Decimal('3.1')),
 ('New Haven-Milford, CT', 23, Decimal('3.0')),
 ('New Orleans-Metairie, LA', 22, Decimal('2.8')),
 ('Red Bluff, CA', 20, Decimal('2.6'))]

In [16]:
%sql SELECT CONCAT(users.first_name, '-', users.last_name) AS user_name, COUNT(DISTINCT songplays.songplay_id) AS num_songs\
    FROM songplays LEFT JOIN users ON songplays.user_id = users.user_id GROUP BY 1 ORDER BY 2 DESC LIMIT 5

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('Ryan-Smith', 55),
 ('Chloe-Cuevas', 42),
 ('Tegan-Levine', 33),
 ('Lily-Burns', 30),
 ('Ava-Robinson', 26)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).